Tekla Open API Reference for Tekla Structures 2025
GeometricPlane Constructor
 Instantiates an XY-plane with the origin at (0,0,0).
 Namespace: Tekla.Structures.Geometry3d
 Assembly: Tekla.Structures (in Tekla.Structures.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public GeometricPlane()
Public Sub New
See Also
Reference
GeometricPlane Class
GeometricPlane Overload
Tekla.Structures.Geometry3d Namespace